Урок 5. Функции и одномерные массивы
Задача 34: Задайте массив заполненный случайными положительными 
трёхзначными числами. Напишите программу, которая покажет количество
чётных чисел в массиве.
[345, 897, 568, 234] -> 2



Задача 36: Задайте одномерный массив, заполненный случайными числами.
Найдите сумму элементов, стоящих на нечётных позициях.
[3, 7, 23, 12] -> 19
[-4, -6, 89, 6] -> 0



Задача 38: Задайте массив вещественных чисел. Найдите разницу между 
максимальным и минимальным элементов массива.



Задача 30: - HARD необязательная Напишите программу, которая на вход
получает размерность массива. Далее заполняет его случайными 
уникальными числами и выводит на экран. Далее производим сортировку 
массива от большего к меньшему и выводим на экран. Далее придумываем
алгоритм перемешивания списка на основе случайности , применяем этот
алгоритм и выводим на экран результат. Встроенные методы работы со списками
использовать нельзя.